Documents/ЛБ_РасходОтходовДМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_РасходОтходовДМ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЛБ_ДвижениеОтходов</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ОтходыДМВПути</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесБезТары</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инкассатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерНакладной</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛомбардПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийОтходыДМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ЛБ_ДвижениеОтходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_ДвижениеОтходов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВесНетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛомбардПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_ОтходыДМВПути.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_ОтходыДМВПути</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВесНетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛомбардОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛомбардПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПеремещения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_РасходОтходовДМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ЛБ_РасходОтходовДМ/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Разделитель = "/";
	Длина = СтрДлина(ЭтотОбъект.Номер);
	РазделительВСтроке = СтрНайти(ЭтотОбъект.Номер, Разделитель);
	
	Если РазделительВСтроке > 0 Тогда
		НомерЛ = Лев(ЭтотОбъект.Номер, РазделительВСтроке - 1);
		НомерД = Прав(ЭтотОбъект.Номер, Длина - РазделительВСтроке);
		
		НомерЛБезНулей = СтроковыеФункцииКлиентСервер.УдалитьПовторяющиесяСимволы(НомерЛ, "0");
		НомерДБезНулей = СтроковыеФункцииКлиентСервер.УдалитьПовторяющиесяСимволы(НомерД, "0");
		
		Если ЭтотОбъект.Ломбард = Справочники.ЛБ_Ломбарды.ЦентральныйОфис Тогда
			ЭтотОбъект.НомерДокумента = НомерДБезНулей;
		Иначе
			ЭтотОбъект.НомерДокумента = НомерЛБезНулей + Разделитель + НомерДБезНулей;
		КонецЕсли;
		
		ЭтотОбъект.Записать();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.НомерНакладной) Тогда
		ЭтотОбъект.НомерНакладной = ЭтотОбъект.НомерДокумента;
		ЭтотОбъект.Записать();
	КонецЕсли;
	
	Движения.ЛБ_ДвижениеОтходов.Записывать = Истина;

	Движение = Движения.ЛБ_ДвижениеОтходов.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Ломбард = ЭтотОбъект.Ломбард;
	Движение.ВесНетто = ЭтотОбъект.ВесБезТары;
	Движение.Организация = ЭтотОбъект.Организация;
	Движение.Период = ЭтотОбъект.Дата;
	//+МАН 17.12.25
	Движение.Склад = ЭтотОбъект.Склад;
	Движение.ЛомбардПолучатель = ЭтотОбъект.Получатель;
	Движение.СкладПолучатель = ЭтотОбъект.СкладПолучатель;
	
	Движения.ЛБ_ОтходыДМВПути.Записывать = Истина;
	
	Движение = Движения.ЛБ_ОтходыДМВПути.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Организация = ЭтотОбъект.Организация;
	Движение.ЛомбардОтправитель = ЭтотОбъект.Ломбард;
	Движение.СкладОтправитель = ЭтотОбъект.Склад;
	Движение.ЛомбардПолучатель = ЭтотОбъект.Получатель;
	Движение.СкладПолучатель = ЭтотОбъект.СкладПолучатель;
	Движение.ВесНетто = ЭтотОбъект.ВесБезТары;
	Движение.Период = ЭтотОбъект.Дата;
	Движение.ДокументПеремещения = ЭтотОбъект.Ссылка;
	//-МАН
	
КонецПроцедуры
